In [1]:
import pandas as pd

In [2]:
# getting started with pandas dataframe datastructure in pandas

In [3]:
# dataframe is the two axised labeld array

In [5]:
record1=pd.Series({
    "name":"gokul",
    "class":"7th sem",
    "college":"cmrit"
})
record2=pd.Series({
    "name":"hari",
    "class":"7th sem",
    "college":"cmrit"
})
record3=pd.Series({
    "name":"go",
    "class":"1 st sem",
    "college":"sddsD"
})

In [6]:
record1

name         gokul
class      7th sem
college      cmrit
dtype: object

In [7]:
record2

name          hari
class      7th sem
college      cmrit
dtype: object

In [8]:
record3

name             go
class      1 st sem
college       sddsD
dtype: object

In [11]:
df=pd.DataFrame([record1,record2,record3],index=['school1','scho0l2','school3'])

In [12]:
df

          name     class college
school1  gokul   7th sem   cmrit
scho0l2   hari   7th sem   cmrit
school3     go  1 st sem   sddsD

In [13]:
# another way of doing thsi is list of dicitonary

In [14]:
k=[{
    "name":"gokul",
    "class":"7th sem",
    "college":"cmrit"
},{
    "name":"hari",
    "class":"7th sem",
    "college":"cmrit"
},{
    "name":"go",
    "class":"1 st sem",
    "college":"sddsD"
}
]

In [15]:
k

[{'name': 'gokul', 'class': '7th sem', 'college': 'cmrit'},
 {'name': 'hari', 'class': '7th sem', 'college': 'cmrit'},
 {'name': 'go', 'class': '1 st sem', 'college': 'sddsD'}]

In [17]:
df=pd.DataFrame(k,index=['school1','scho0l2','school3'])

In [18]:
df

          name     class college
school1  gokul   7th sem   cmrit
scho0l2   hari   7th sem   cmrit
school3     go  1 st sem   sddsD

In [23]:
df.loc['school3']

name             go
class      1 st sem
college       sddsD
Name: school3, dtype: object

In [24]:
df.loc['school3']['name']

'go'

In [26]:
type(df.loc['school3']['name'])

str

In [27]:
type(df.loc['school3'])

pandas.core.series.Series

In [31]:
df.loc['school1','name']

'gokul'

In [32]:
# transposing the dataframe matrix where rows and columns are interchanged

In [34]:
df.T

         school1  scho0l2   school3
name       gokul     hari        go
class    7th sem  7th sem  1 st sem
college    cmrit    cmrit     sddsD

In [35]:
# in  pandas columns will always have namer

In [36]:
df.head()

          name     class college
school1  gokul   7th sem   cmrit
scho0l2   hari   7th sem   cmrit
school3     go  1 st sem   sddsD

In [37]:
df

          name     class college
school1  gokul   7th sem   cmrit
scho0l2   hari   7th sem   cmrit
school3     go  1 st sem   sddsD

In [38]:
df

          name     class college
school1  gokul   7th sem   cmrit
scho0l2   hari   7th sem   cmrit
school3     go  1 st sem   sddsD

In [46]:
df

          name     class college
school1  gokul   7th sem   cmrit
scho0l2   hari   7th sem   cmrit
school3     go  1 st sem   sddsD

In [48]:
df.loc[:,["name","class"]]#loc attribute allows alicing

          name     class
school1  gokul   7th sem
scho0l2   hari   7th sem
school3     go  1 st sem

In [51]:
df.loc[["school1","school3"],["name","college"]]# loc attribute first list is for row selection and first colemn is for column selection

          name college
school1  gokul   cmrit
school3     go   sddsD

In [ ]:
# drop is pandas

In [ ]:
df.drop()